In [1]:
import numpy as np
import pandas as pd

In [ ]:
data = {
    'Employee_ID': range(1001, 1021),
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve', 'Frank', 'Grace', 'Henry', 'Ivy', 'Jack',
            'Karen', 'Leo', 'Mia', 'Nathan', 'Olivia', 'Peter', 'Quinn', 'Rachel', 'Sam', 'Tina'],
    'Department': ['HR', 'IT', 'Finance', 'IT', 'Marketing', np.nan, 'HR', 'Finance', 'IT', 'Marketing',
                'HR', np.nan, 'IT', 'Finance', 'Marketing', 'HR', 'IT', np.nan, 'Finance', 'Marketing'],
    'Salary': [50000, 75000, 60000, np.nan, 55000, 65000, 52000, np.nan, 70000, 58000,
            51000, 72000, np.nan, 62000, 56000, 53000, 68000, 59000, np.nan, 54000],
    'Age': [28, 35, 42, 29, 31, np.nan, 26, 38, 33, 30, 
            27, 36, 29, np.nan, 32, 28, 34, 31, 40, 29],
    'Experience_Years': [3, 8, 15, 4, 6, 7, 2, 12, 8, 5,
                        np.nan, 9, 4, 11, 7, 3, 10, 6, 13, np.nan],
    'Performance_Score': [85, 92, 78, np.nan, 88, 76, 90, 82, 95, 87,
                        84, np.nan, 89, 79, 91, 86, 93, 81, 77, np.nan]
}

df = pd.DataFrame(data)
print('\n print first 5 rows of the dataframe')
df.head(6)
print
df.tail(10)

 print first 5 rows of the dataframe

,Employee_ID,Name,Department,Salary,Age,Experience_Years,Performance_Score
10,1011,Karen,HR,51000.0,27.0,NaN,84.0
11,1012,Leo,NaN,72000.0,36.0,9.0,NaN
12,1013,Mia,IT,NaN,29.0,4.0,89.0
13,1014,Nathan,Finance,62000.0,NaN,11.0,79.0
14,1015,Olivia,Marketing,56000.0,32.0,7.0,91.0
15,1016,Peter,HR,53000.0,28.0,3.0,86.0
16,1017,Quinn,IT,68000.0,34.0,10.0,93.0
17,1018,Rachel,NaN,59000.0,31.0,6.0,81.0
18,1019,Sam,Finance,NaN,40.0,13.0,77.0
19,1020,Tina,Marketing,54000.0,29.0,NaN,NaN

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee_ID        20 non-null     int64
 1   Name               20 non-null     object
 2   Department         17 non-null     object
 3   Salary             16 non-null     float64
 4   Age                18 non-null     float64
 5   Experience_Years   18 non-null     float64
 6   Performance_Score  17 non-null     float64
dtypes: float64(4), int64(1), object(2)
memory usage: 1.2+ KB

In [7]:
df.shape

(20, 7)

In [8]:
df.describe()

,Employee_ID,Salary,Age,Experience_Years,Performance_Score
count,20.00000,16.000000,18.000000,18.000000,17.000000
mean,1010.50000,60000.000000,32.111111,7.388889,85.470588
std,5.91608,7907.802055,4.574725,3.712283,5.896160
min,1001.00000,50000.000000,26.000000,2.000000,76.000000
25%,1005.75000,53750.000000,29.000000,4.250000,81.000000
50%,1010.50000,58500.000000,31.000000,7.000000,86.000000
75%,1015.25000,65750.000000,34.750000,9.750000,90.000000
max,1020.00000,75000.000000,42.000000,15.000000,95.000000

In [9]:
df.isnull().sum()

Employee_ID          0
Name                 0
Department           3
Salary               4
Age                  2
Experience_Years     2
Performance_Score    3
dtype: int64

 How to identify null values in the dataframe?

In [11]:
null_values = df.isnull().sum()
print('\n Null values in each column')
print(null_values)
print('\n Total null values in the dataframe:', null_values.sum())

 Null values in each column
Employee_ID          0
Name                 0
Department           3
Salary               4
Age                  2
Experience_Years     2
Performance_Score    3
dtype: int64

 Total null values in the dataframe: 14

In [12]:
# Method 2: Check if any null values exist
has_nulls = df.isnull().any().any()
print(f"\nHas any null values: {has_nulls}")

# Method 3: Get percentage of null values
null_percentage = (df.isnull().sum() / len(df)) * 100
print("\nNull percentage per column:")
print(null_percentage)

Has any null values: True

Null percentage per column:
Employee_ID           0.0
Name                  0.0
Department           15.0
Salary               20.0
Age                  10.0
Experience_Years     10.0
Performance_Score    15.0
dtype: float64